Tsung/trend.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

	<!-- Client side setup -->
	<clients>
		<client host="localhost" use_controller_vm="true" maxusers='15000'/>
	</clients>

	<!-- Server side setup -->
	<servers>
		<server host="52.91.45.201" port="80" type="tcp"></server>
	</servers>
	<load>
		<arrivalphase phase="1" duration="30" unit="second">
			<users arrivalrate="20" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="2" duration="30" unit="second">
			<users arrivalrate="24" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="3" duration="30" unit="second">
			<users arrivalrate="28" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="4" duration="30" unit="second">
			<users arrivalrate="32" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="5" duration="30" unit="second">
			<users arrivalrate="36" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="6" duration="30" unit="second">
			<users arrivalrate="40" unit="second"></users>
		</arrivalphase>
		<arrivalphase phase="7" duration="30" unit="second">
			<users arrivalrate="44" unit="second"></users>
		</arrivalphase>

	</load>
	<options>
		<!-- Set connection timeout to 2 seconds -->
		<option name="global_ack_timeout" value="2000"></option>
		<option type="ts_http" name="user_agent">
			<user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
		</option>
	</options>
	<sessions>
		<session name="http-example" probability="100" type="ts_http">

			

			<!-- do random GTS -->
			<transaction name = "google_trends_random">
				<request>
					<dyn_variable name="redirect" re="Location: (http://.*)\r"/>
					<http url='/random_gt_query/gts' version='1.1' method='GET'></http>
				</request>
				<request subst="true">
					<http url="%%_redirect%%" method="GET"></http>
				</request>
			</transaction>

			<!-- Wait 1 seconds -->
			<thinktime value="1" random="true"></thinktime>
			
			<transaction name = "trend_strategy">
				<request>
					<http url='/google_trends_strategy/show?trend_term=debt&amp;stock_symbol=Apple%20Inc.(AAPL)' version='1.1' method='GET'></http>
				</request>
			</transaction>

		</session>
	</sessions>
</tsung>